<a href="https://colab.research.google.com/github/SANGSEOSEO/philosophy_datascience/blob/master/%5B%EC%8B%A4%EC%8A%B5%5DCh01_pandas_10~15_copy~index.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd

## 실습에 활용한 예제

[국내 아이돌 평판지수 (csv)](http://bit.ly/ds-korean-idol)

## DataFrame 로드

In [5]:
df = pd.read_csv('https://bit.ly/ds-korean-idol')

## 1. copy (복사)

copy는 단어 그대로, dataframe을 복사할 때 사용합니다.

In [6]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

df를 **새로운 변수(new_df)에 대입**해 주고, 새로운 변수에서 값을 바꾼다면, 원래의 DataFrame의 값은 어떻게 될까요?

In [7]:
new_df = df

In [8]:
new_df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [9]:
# 새로운 변수에 데이터프레임을 할당하는 방식하는 하면?
# 한 dataframe에서 변경이 일어났을때 새로이 할당된 dataframe의 영향은?
new_df['이름'] = 'SANGSEO SEO'

In [10]:
new_df.head()

            이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0  SANGSEO SEO  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  SANGSEO SEO     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  SANGSEO SEO    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3  SANGSEO SEO  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4  SANGSEO SEO    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [11]:
df.head()

            이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0  SANGSEO SEO  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  SANGSEO SEO     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  SANGSEO SEO    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3  SANGSEO SEO  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4  SANGSEO SEO    마마무  RBW  여자  1995-07-23  162.1   A   7650928

이렇게 되는 이유는 같은 메모리 주소를 참조하기 때문입니다.

In [12]:
# 똑같네.그럼 새로히 할당하면 안되겠네.
if hex(id(new_df)) == hex(id(df)):
  print('동일해요')
else:
  print('전혀 달라요')

동일해요

In [14]:
hex(id(new_df)) , hex(id(df))

('0x7fa777033f98', '0x7fa777033f98')

굉장히 많은 분들이 실수를 하시는 부분입니다.

**원본 데이터를 유지 시키고, 새로운 변수에 복사할 때는 copy()를 사용해 주세요**

In [29]:
df = pd.read_csv('https://bit.ly/ds-korean-idol')

In [30]:
# deep=True로 하면 copy_df를 변경하더라도 원본의 데이터의 변경이 없다.즉, 새로운 개체라는 얘기
copy_df = df.copy()  # deeep=True - 기본값이 True

In [31]:
if (hex(id(df)) == hex(id(copy_df))):
  print('동일')
else:
  print('달라!!')

달라!!

In [32]:
# 메모리 주소도 다름
hex(id(df)) , hex(id(copy_df))

('0x7fa77695f4e0', '0x7fa76ec8c908')

In [37]:
# 아이돌 중 지드래곤의 이름을 바꿈
copy_df.loc[copy_df['이름']=='지드래곤', '이름'] = 'SANGSE SEO'

In [38]:
# 이름이 바뀐것을 확인
# 민감한 정보는 빼고 
copy_df[['이름', '그룹', '소속사', '성별', '키', '브랜드평판지수']]

            이름     그룹      소속사  성별      키   브랜드평판지수
0           지민  방탄소년단      빅히트  남자  173.6  10523260
1   SANGSE SEO     빅뱅       YG  남자  177.0   9916947
2         강다니엘    NaN      커넥트  남자  180.0   8273745
3            뷔  방탄소년단      빅히트  남자  178.0   8073501
4           화사    마마무      RBW  여자  162.1   7650928
5           정국  방탄소년단      빅히트  남자  178.0   5208335
6           민현   뉴이스트     플레디스  남자  182.3   4989792
7           소연    아이들       큐브  여자    NaN   4668615
8            진  방탄소년단      빅히트  남자  179.2   4570308
9          하성운     핫샷  스타크루이엔티  남자  167.1   4036489
10          태연   소녀시대       SM  여자    NaN   3918661
11         차은우   아스트로     판타지오  남자  183.0   3506027
12          백호   뉴이스트     플레디스  남자  175.0   3301654
13          JR   뉴이스트     플레디스  남자  176.0   3274137
14          슈가  방탄소년단      빅히트  남자  174.0   2925442

In [39]:
# 원본은 변경없음.
df.head(n=2)

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947

In [40]:
# deep=False :  데이터는 복사하지않고,참조한다.데이터를 요청할때.
# 즉,shawllow copy란 얘기이다.
deepC_False = df.copy(deep=False)

In [42]:
if (hex(id(df)) == hex(id(deepC_False))):
  print('동일')
else:
  print('달라!!')

hex(id(df)) , hex(id(deepC_False))

달라!!

('0x7fa77695f4e0', '0x7fa77695f518')

In [44]:
# 원본을 변경하면 
df.loc[df['이름']=='지드래곤', '이름'] = 'SANGSE SEO'

In [47]:
# shawllow copy한 DataFrame객체도 조회화면 동일한 데이터프레임을 참조함을 알수있다.
deepC_False[['이름', '그룹', '소속사', '성별', '키', '브랜드평판지수']].head()

           이름     그룹  소속사  성별      키   브랜드평판지수
0          지민  방탄소년단  빅히트  남자  173.6  10523260
1  SANGSE SEO     빅뱅   YG  남자  177.0   9916947
2        강다니엘    NaN  커넥트  남자  180.0   8273745
3           뷔  방탄소년단  빅히트  남자  178.0   8073501
4          화사    마마무  RBW  여자  162.1   7650928

## 2. row, column 추가 및 삭제

### 2-1. row의 추가

In [ ]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

dictionary 형태의 데이터를 만들어 준다음 **append()** 함수를 사용하여 데이터를 추가할 수 있습니다. 반드시, **ignore_index=True** 옵션을 같이 추가해 주셔야 에러가 안납니다!

In [48]:
new_dic = {
     '이름': '테디', 
     '그룹': '테디그룹', 
     '소속사': '끝내주는소속사', 
     '성별': '남자', 
     '생년월일': '1970-01-01', 
     '키': 195.0, 
     '혈액형': 'O', 
     '브랜드평판지수': 12345678
}

In [50]:
# DataFrame에 추가.맨끝에 추가됨을 확인
# append()는 DataFrame을 리턴한다.즉 ,복사본을 생성한다는 의미.
df.append(new_dic, ignore_index=True).tail()

     이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수
11  차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
12   백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
13   JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
14   슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442
15   테디   테디그룹  끝내주는소속사  남자  1970-01-01  195.0   O  12345678

In [65]:
# 원본 데이터 프레임 확인
df.tail()[['이름', '그룹', '소속사', '성별','브랜드평판지수', '국적']]

     이름     그룹      소속사  성별   브랜드평판지수    국적
11  차은우   아스트로     판타지오  남자   3506027  대한민국
12   백호   뉴이스트     플레디스  남자   3301654  대한민국
13   JR   뉴이스트     플레디스  남자   3274137  대한민국
14   슈가  방탄소년단      빅히트  남자   2925442  대한민국
15   테디   테디그룹  끝내주는소속사  남자  12345678  대한민국

또한, append() 한 뒤 다시 df에 대입해줘야 변경한 값이 유지 됩니다.
  - 이 의미는 복사본을 생성하고 append결과가 리턴된다는 의미
  - 그래서 데이터 프레임에 재할당하는구나.

In [52]:
df = df.append(new_dic,ignore_index=True)

In [63]:
df.tail()[['이름', '그룹', '소속사', '브랜드평판지수', '국적']]

     이름     그룹      소속사   브랜드평판지수    국적
11  차은우   아스트로     판타지오   3506027  대한민국
12   백호   뉴이스트     플레디스   3301654  대한민국
13   JR   뉴이스트     플레디스   3274137  대한민국
14   슈가  방탄소년단      빅히트   2925442  대한민국
15   테디   테디그룹  끝내주는소속사  12345678  대한민국

### 2-2. column 추가

column 추가는 매우 쉽습니다. 단순히 새로운 column을 만들고 값을 대입해주면, 자동으로 생성합니다.

In [ ]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [54]:
df['국적'] = 'KRA0900'

In [62]:
df.head()[['이름', '그룹', '소속사', '브랜드평판지수', '국적']]

           이름     그룹  소속사   브랜드평판지수    국적
0          지민  방탄소년단  빅히트  10523260  대한민국
1  SANGSE SEO     빅뱅   YG   9916947  대한민국
2        강다니엘    NaN  커넥트   8273745   USA
3           뷔  방탄소년단  빅히트   8073501  대한민국
4          화사    마마무  RBW   7650928  대한민국

전부 동일한 값이 추가 되면서, column도 추가된 것을 보실 수 있습니다.

만약, 값을 변경하고 싶다면, loc 함수를 활용해서 변경해 줄 수 있겠죠?

In [56]:
# 전체 로우에 해당하는 국적컬럼의 데이터를 대한민국으로 바꾸기 
# 행(로우): 모든 행
# 열(컬럼): '국적'
df.loc[:,'국적'] = '대한민국'

In [61]:
df.head()[['이름', '그룹', '소속사', '브랜드평판지수', '국적']]

           이름     그룹  소속사   브랜드평판지수    국적
0          지민  방탄소년단  빅히트  10523260  대한민국
1  SANGSE SEO     빅뱅   YG   9916947  대한민국
2        강다니엘    NaN  커넥트   8273745   USA
3           뷔  방탄소년단  빅히트   8073501  대한민국
4          화사    마마무  RBW   7650928  대한민국

In [57]:
# 특정 조건에 맞는 정보만 변경
df.loc[df['이름']=='강다니엘','국적'] = 'USA'

In [58]:
df.loc[df['이름']=='강다니엘','국적']

2    USA
Name: 국적, dtype: object

In [60]:
# 이렇게 가져올수도 있네요.
df.head()[['이름', '그룹', '소속사', '브랜드평판지수', '국적']]

           이름     그룹  소속사   브랜드평판지수    국적
0          지민  방탄소년단  빅히트  10523260  대한민국
1  SANGSE SEO     빅뱅   YG   9916947  대한민국
2        강다니엘    NaN  커넥트   8273745   USA
3           뷔  방탄소년단  빅히트   8073501  대한민국
4          화사    마마무  RBW   7650928  대한민국

## 3. 통계값 다루기

In [66]:
df = pd.read_csv('https://bit.ly/ds-korean-idol')
df.loc[df['생년월일'], '생년월일'] = df['생년월일'].str.replace(,)

통계값은 data type이 float나 int형 인 column을 다룹니다

In [ ]:
# 데이터 프레임의 컬럼의 정보 및 데이터 타입 정보, NaN정보 확인 가능
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   이름       15 non-null     object
 1   그룹       14 non-null     object
 2   소속사      15 non-null     object
 3   성별       15 non-null     object
 4   생년월일     15 non-null     object
 5   키        13 non-null     float64
 6   혈액형      15 non-null     object
 7   브랜드평판지수  15 non-null     int64
dtypes: float64(1), int64(1), object(6)
memory usage: 1.1+ KB

In [ ]:
# 대략적인 통계값을 알 수 있다.(산술통계)
df.describe()

                키       브랜드평판지수
count   13.000000  1.500000e+01
mean   175.792308  5.655856e+06
std      5.820576  2.539068e+06
min    162.100000  2.925442e+06
25%    174.000000  3.712344e+06
50%    177.000000  4.668615e+06
75%    179.200000  7.862214e+06
max    183.000000  1.052326e+07

### 3-1. min(최소값), max(최대값)

통계값은 data type이 float나 int형 인 column을 다룹니다

In [68]:
df['키'].min()

162.1

In [69]:
df['키'].max()

183.0

### 3-2. sum (합계), mean (평균)

In [70]:
df['키'].mean()

175.7923076923077

In [71]:
df['키'].sum()

2285.3

### 3-3. var, variance(분산) / std, standard deviation (표준 편차)

* 분산과 표준편차는 데이터가 **평균으로부터 얼마나 떨어져 있는지 정도**를 나타냅니다.
* 분산은 **(데이터 - 평균) ** 2 을 모두 합한 값** / n
* 표준편차는 **분산의 루트**

In [72]:
import numpy as np

In [73]:
data_01 = np.array([1, 3, 5, 7, 9])
data_02 = np.array([3, 4, 5, 6, 7])

In [ ]:
# 표준편차
np.sqrt(((1-5)**2 + (3-5)**2 + (5-5)**2 + (7-5)**2 + (9-5)**2 ) / 5)

2.8284271247461903

In [ ]:
# data_02의 표준편차
np.sqrt(((3-5)**2 + (4-5)**2 + (5-5)**2 + (6-5)**2 + (7-5)**2 ) / 5)

1.4142135623730951

In [ ]:
data_01.mean()

5.0

In [ ]:
data_02.mean()

5.0

In [ ]:
# 분산
data_01.var(), data_02.var()

(8.0, 2.0)

In [74]:
# 표준편차
np.sqrt(data_01.var()), np.sqrt(data_02.var())

(2.8284271247461903, 1.4142135623730951)

In [ ]:
data_01.std(), data_02.std()

(2.8284271247461903, 1.4142135623730951)

주로 표준편자 (std)를 많이 사용하며, **데이터가 평균으로부터 얼마나 퍼져있는지 정도를 나타내는 지표라고 이해**하시면 됩니다.

In [76]:
df['키'].var()

33.879102564102595

In [77]:
df['키'].std()

5.820575793175672

### 3-4. 갯수를 세는 count

In [80]:
df['키'].count()

13

### 3.5. 중앙값

In [ ]:
df['키']

0     173.6
1     177.0
2     180.0
3     178.0
4     162.1
5     178.0
6     182.3
7       NaN
8     179.2
9     167.1
10      NaN
11    183.0
12    175.0
13    176.0
14    174.0
15    195.0
Name: 키, dtype: float64

In [81]:
# 오름차순으로 정렬 후 가장 가운데 있는 값
df['키'].median()

177.0

### 3.6. 최빈값 (mode)
 - 가장 빈도가 많이 발생한 값은?

In [82]:
df['키'].mode()

0    178.0
dtype: float64

## 4. 피벗테이블 (pivot_table)

* 피벗테이블은 엑셀의 피벗테이블과 동일합니다.
* 데이터 열 중에서 **두 개의 열을 각각 행 인덱스, 열 인덱스로 사용**하여 데이터를 조회하여 펼쳐놓은 것을 의미합니다.
* 왼쪽에 나타나는 인덱스를 **행 인덱스, 상단에 나타나는 인덱스를 열 인덱스**라고 부릅니다.

In [ ]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [84]:
# index는 행 인덱스 ,# columns는 열 인덱스 ,# values는 조회하고 싶은 값
pd.pivot_table(df,index='소속사', columns='혈액형',values='키')

혈액형          A     AB      B       O
소속사
RBW      162.1    NaN    NaN     NaN
YG       177.0    NaN    NaN     NaN
빅히트      175.8  178.0    NaN  176.60
스타크루이엔티  167.1    NaN    NaN     NaN
커넥트      180.0    NaN    NaN     NaN
판타지오       NaN    NaN  183.0     NaN
플레디스       NaN  175.0    NaN  179.15

In [83]:
# aggfunc에는 추가 계산 옵션 (np.sum, np.mean) - 기본값은 평균
pd.pivot_table(df, index='그룹', columns='혈액형', values='브랜드평판지수', aggfunc=np.sum)

혈액형             A         AB          B          O
그룹
뉴이스트          NaN  3301654.0        NaN  8263929.0
마마무     7650928.0        NaN        NaN        NaN
방탄소년단  15731595.0  8073501.0        NaN  7495750.0
빅뱅      9916947.0        NaN        NaN        NaN
소녀시대    3918661.0        NaN        NaN        NaN
아스트로          NaN        NaN  3506027.0        NaN
아이들           NaN        NaN  4668615.0        NaN
핫샷      4036489.0        NaN        NaN        NaN

In [ ]:
pd.pivot_table(df, index='그룹', columns='혈액형', values='브랜드평판지수', aggfunc='mean')

혈액형            A         AB          B           O
그룹
뉴이스트         NaN  3301654.0        NaN   4131964.5
마마무    7650928.0        NaN        NaN         NaN
방탄소년단  7865797.5  8073501.0        NaN   3747875.0
빅뱅     9916947.0        NaN        NaN         NaN
소녀시대   3918661.0        NaN        NaN         NaN
아스트로         NaN        NaN  3506027.0         NaN
아이들          NaN        NaN  4668615.0         NaN
테디그룹         NaN        NaN        NaN  12345678.0
핫샷     4036489.0        NaN        NaN         NaN

## 5. GroupBy (그룹으로 묶어 보기)

* groupby는 데이터를 **그룹으로 묶어 분석**할 때 활용합니다.
* **소속사**별 키의 평균, **성별** 키의 평균 등 특정, 그룹별 통계 및 데이터의 성질을 확인하고자 할 때 활용합니다.

In [ ]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수    국적
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260  대한민국
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947  대한민국
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745   USA
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501  대한민국
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928  대한민국

In [ ]:
df.groupby(by='소속사')

groupby와 함께 

* count() - 갯수
* sum() - 합계
* mean() - 평균
* var() - 분산
* std() - 표준편차
* min()/max() - 최소값, 최대값

In [ ]:
df.groupby(by='소속사').count()

         이름  그룹  성별  생년월일  키  혈액형  브랜드평판지수  국적
소속사
RBW       1   1   1     1  1    1        1   1
SM        1   1   1     1  0    1        1   1
YG        1   1   1     1  1    1        1   1
끝내주는소속사   1   1   1     1  1    1        1   1
빅히트       5   5   5     5  5    5        5   5
스타크루이엔티   1   1   1     1  1    1        1   1
커넥트       1   0   1     1  1    1        1   1
큐브        1   1   1     1  0    1        1   1
판타지오      1   1   1     1  1    1        1   1
플레디스      3   3   3     3  3    3        3   3

산술 통계는 자동으로 산술통계가 가능한 열만 출력됩니다.

In [102]:
df.groupby(by='그룹').mean()

                키       브랜드평판지수
그룹
뉴이스트   177.766667  3.855194e+06
마마무    162.100000  7.650928e+06
방탄소년단  176.560000  6.260169e+06
빅뱅     177.000000  9.916947e+06
소녀시대          NaN  3.918661e+06
아스트로   183.000000  3.506027e+06
아이들           NaN  4.668615e+06
핫샷     167.100000  4.036489e+06

In [104]:
df.groupby(by='성별').sum()

         키   브랜드평판지수
성별
남자  2123.2  68599637
여자   162.1  16238204

특정 열만 출력하고 싶다면?

In [105]:
# 산술통계만 포함된다.즉, 수식값만 해당 함.
# 혈액형으로 GROUPBY해 키의 평균값을 가져옴.즉, 혈액형별 평균키
df.groupby(by='혈액형')['키'].mean()  #  df.groupby(by='혈액형').mean()['키']

혈액형
A     172.966667
AB    176.500000
B     183.000000
O     177.875000
Name: 키, dtype: float64

## 6. Multi-Index(복합 인덱스)

### 6-1. Multi-Index 적용

행 인덱스를 복합적으로 구성하고 싶은 경우는 인덱스를 리스트로 만들어 줍니다.
 - SQL에서 GROUPBY가 여러개인 것을 의미

In [ ]:
df.groupby(by=['혈액형', '성별']).std()

               키       브랜드평판지수
혈액형 성별
A   남자  5.056481  2.862951e+06
    여자       NaN  2.639111e+06
AB  남자  2.121320  3.374205e+06
B   남자       NaN           NaN
    여자       NaN           NaN
O   남자  8.283719  3.856730e+06

In [ ]:
df.groupby(by=['혈액형', '성별']).mean()

             키    브랜드평판지수
혈액형 성별
A   남자  175.14  7591755.2
    여자  162.10  5784794.5
AB  남자  176.50  5687577.5
B   남자  183.00  3506027.0
    여자     NaN  4668615.0
O   남자  181.30  5621071.4

### 6-2. Multi-Index 데이터 프레임을 피벗 테이블로 변환

Multi-Index로 된 데이터프레임을 피벗테이블 형태로 다시 변환해 줄 수 있습니다.

In [106]:
df2 = df.groupby(by=['혈액형', '성별']).mean()

In [107]:
df2

              키     브랜드평판지수
혈액형 성별
A   남자  175.140  7591755.20
    여자  162.100  5784794.50
AB  남자  176.500  5687577.50
B   남자  183.000  3506027.00
    여자      NaN  4668615.00
O   남자  177.875  3939919.75

In [ ]:
# 원본 df2는 그대로 두고 복사본에 만듦
# groupby되어 있던 값은 그대로 이지만 컬럼 레벨로 올라감.(PIVOTING과 동일)
df2.unstack(level='혈액형')

          키                         브랜드평판지수
혈액형       A     AB      B      O          A         AB          B          O
성별
남자   175.14  176.5  183.0  181.3  7591755.2  5687577.5  3506027.0  5621071.4
여자   162.10    NaN    NaN    NaN  5784794.5        NaN  4668615.0        NaN

In [110]:
# 위의 df2.unstack(level=`'혈액형'`) 은 아래 pivot_table과 동일한 결과를 낸다.
# 위치만 차이가 남.
df2.pivot_table(values=['키', '브랜드평판지수'], index='성별', columns='혈액형', aggfunc='mean')

       브랜드평판지수                                         키
혈액형          A         AB          B           O       A     AB      B        O
성별
남자   7591755.2  5687577.5  3506027.0  3939919.75  175.14  176.5  183.0  177.875
여자   5784794.5        NaN  4668615.0         NaN  162.10    NaN    NaN      NaN

In [ ]:
df2.unstack(level='성별')

          키           브랜드평판지수
성별       남자     여자         남자         여자
혈액형
A    175.14  162.1  7591755.2  5784794.5
AB   176.50    NaN  5687577.5        NaN
B    183.00    NaN  3506027.0  4668615.0
O    181.30    NaN  5621071.4        NaN

### 6-3. 인덱스 초기화 (reset_index)

reset_index() 는 Multi-Index로 구성된 데이터 프레임의 **인덱스를 초기화**해 줍니다.

In [111]:
df2  # multi index로 groupby된 결과

              키     브랜드평판지수
혈액형 성별
A   남자  175.140  7591755.20
    여자  162.100  5784794.50
AB  남자  176.500  5687577.50
B   남자  183.000  3506027.00
    여자      NaN  4668615.00
O   남자  177.875  3939919.75

In [112]:
# 2차원 데이터 프레임으로 변환(가공된 원본 데이터라고 보면된다.)
# 인덱스를 초기화한다고 보면되며, 기본적으로 순차적으로 시작하는 인덱스로 다시 재생성된다고 보면 됨
# 0, 1, 2, 3,......N
df2.reset_index()

  혈액형  성별        키     브랜드평판지수
0   A  남자  175.140  7591755.20
1   A  여자  162.100  5784794.50
2  AB  남자  176.500  5687577.50
3   B  남자  183.000  3506027.00
4   B  여자      NaN  4668615.00
5   O  남자  177.875  3939919.75

In [ ]:
# 2차원 데이터 프레임으로 변환된것을 재할당
df2 = df2.reset_index()

In [ ]:
df2

   index 혈액형  성별       키    브랜드평판지수
0      0   A  남자  175.14  7591755.2
1      1   A  여자  162.10  5784794.5
2      2  AB  남자  176.50  5687577.5
3      3   B  남자  183.00  3506027.0
4      4   B  여자     NaN  4668615.0
5      5   O  남자  181.30  5621071.4